app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT `albums`.* FROM `albums`

  def show
    @album = Album.find(params[:id])
---
SELECT `albums`.* FROM `albums` WHERE (`albums`.`id` = 2) LIMIT 1

  def edit
    @album = Album.find(params[:id])
---
SELECT `albums`.* FROM `albums` WHERE (`albums`.`id` = 7) LIMIT 1

  def create
    @album = Album.new(params[:album])

    album_path = ALBUMS_ROOT + @album.name
    FileUtils.mkdir_p(album_path)

    FileUtils.mkdir_p(album_path + "/pictures")
    FileUtils.mkdir_p(album_path + "/thumbnail")

    respond_to do |format|
      if @album.save
---
INSERT INTO `albums` (`idalbums`, `name`) VALUES (NULL, 'Album1')

  def destroy
    @album = Album.find(params[:id])

    album_path = ALBUMS_ROOT + @album.name
    if(File.exists?(album_path))
      FileUtils.remove_dir(album_path)
    end

    @album.destroy
---
SELECT `albums`.* FROM `albums` WHERE (`albums`.`id` = 1) LIMIT 1
DELETE FROM `albums` WHERE (`albums`.`id` = 1)